# Introducing Pandas Objects

In [2]:
import numpy as np
import pandas as pd

In [3]:
data = pd.Series([0.25,0.5,0.75,1.0])

The Series combines a sequence of values with an explicit sequence of indices, which we can access with the values and index attributes.

In [10]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [11]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [12]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
data[1]

0.5

In [14]:
data[0:3]

0    0.25
1    0.50
2    0.75
dtype: float64

the Pandas Series is much more general and flexible than the
one-dimensional NumPy array that it emulates.

In [16]:
data = pd.Series([1.1,4.1,3.1,12.2],index=['a','b','c','d'])

In [17]:
data

a     1.1
b     4.1
c     3.1
d    12.2
dtype: float64

In [18]:
data['a']

1.1

In [22]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                  index=[2, 5, 3, 7])

In [23]:
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

Series as Specialized Dictionary

In [26]:
population_dic = { 'cali':123213,'texas':12312,
                  'florida':12356634,'ny':987654657,
                  'penn':874213
                    }
population = pd.Series(population_dic)
population

cali          123213
texas          12312
florida     12356634
ny         987654657
penn          874213
dtype: int64

In [27]:
population['cali']

123213

In [28]:
# supports array-style operations such as slicing:
population['cali':'ny']

cali          123213
texas          12312
florida     12356634
ny         987654657
dtype: int64

Constructing Series Objects

pd.Series(data, index=index)

In [29]:
pd.Series([2, 4, 6])

0    2
1    4
2    6
dtype: int64

In [30]:
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

In [31]:
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

In [32]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[1, 2])
# index can be explicitly set to control the order or the subset of keys used

1    b
2    a
dtype: object

The Pandas DataFrame Object

In [36]:
area_dict = {'cali': 423967, 'texas': 695662, 'florida': 170312,
                      'ny': 141297, 'penn': 119280}
area = pd.Series(area_dict)
area

cali       423967
texas      695662
florida    170312
ny         141297
penn       119280
dtype: int64

In [37]:
states = pd.DataFrame({'population':population,
                      'area':area})
states

         population    area
cali         123213  423967
texas         12312  695662
florida    12356634  170312
ny        987654657  141297
penn         874213  119280

In [38]:
states.index

Index(['cali', 'texas', 'florida', 'ny', 'penn'], dtype='object')

In [39]:
states.columns

Index(['population', 'area'], dtype='object')

In [40]:
states['area']

cali       423967
texas      695662
florida    170312
ny         141297
penn       119280
Name: area, dtype: int64

A DataFrame is a collection of Series objects, and a single-column DataFrame can be constructed from a single Series:

In [41]:
pd.DataFrame(population,columns=['population'])
population

cali          123213
texas          12312
florida     12356634
ny         987654657
penn          874213
dtype: int64

In [42]:
data = [{'a': i, 'b': 2 * i}
        for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [43]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

if some keys in the dictionary are missing, Pandas will fill them in with NaN values

In [45]:
# From a two-dimensional NumPy array
pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],index = ['a','b','c'])

        foo       bar
a  0.803719  0.522486
b  0.624410  0.367773
c  0.365304  0.811926

In [49]:
pd.DataFrame(
             columns=['foo', 'bar'],index = ['a','b','c'])

   foo  bar
a  NaN  NaN
b  NaN  NaN
c  NaN  NaN

In [51]:
pd.DataFrame(5,
             columns=['foo', 'bar'],index = ['a','b','c'])

   foo  bar
a    5    5
b    5    5
c    5    5

In [59]:
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [61]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

The Pandas Index Object

In [62]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Index([2, 3, 5, 7, 11], dtype='int64')

In [63]:
ind[1]

3

In [64]:
ind[::2]

Index([2, 5, 11], dtype='int64')

In [65]:
print(ind.size,ind.shape,ind.ndim,ind.dtype)

5 (5,) 1 int64

In [66]:
# One difference between Index objects and NumPy arrays is that the indices are
# immutable—that is, they cannot be modified via the normal means:
ind[1] = 0

TypeError: Index does not support mutable operations

Index as Ordered Set

In [67]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [68]:
indA.intersection(indB)

Index([3, 5, 7], dtype='int64')

In [69]:
indA.union(indB)

Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [71]:
indA.symmetric_difference(indB)

Index([1, 2, 9, 11], dtype='int64')

# Data Indexing and Selection

In [72]:
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
index=['a', 'b', 'c', 'd'])

In [73]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [74]:
data['a']

0.25

In [75]:
'a' in data

True

In [76]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [81]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [82]:
data['e'] = 1.25

In [83]:
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [84]:
# slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

Notice that when slicing with an explicit index (e.g., data['a':'c']), the final index is included in the slice, 

while when slicing with an implicit index (e.g., data[0:2]), the final index is excluded from the slice.

In [85]:
# slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [86]:
# masking
data[(data>0.3)&(data<0.8)]

b    0.50
c    0.75
dtype: float64

In [87]:
# fancy indexing 
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

Indexers: loc and iloc

In [88]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [89]:
# explicit index when indexing
data[1]

'a'

In [90]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

Because of this potential confusion in the case of integer indexes,

First, the loc attribute allows indexing and slicing that always references the explicit index:

In [92]:
data.loc[1]

'a'

In [94]:
data.loc[1:3]

1    a
3    b
dtype: object

The iloc attribute allows indexing and slicing that always references the implicit Python-style index:

In [95]:
data.iloc[1]

'b'

In [96]:
data.iloc[1:3]

3    b
5    c
dtype: object

Data Selection in DataFrames

In [98]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                           'Florida': 170312, 'New York': 141297,
                           'Pennsylvania': 119280})
pop = pd.Series({'California': 39538223, 'Texas': 29145505,
                          'Florida': 21538187, 'New York': 20201249,
                          'Pennsylvania': 13002700})
data = pd.DataFrame({'area':area, 'pop':pop})
data

                area       pop
California    423967  39538223
Texas         695662  29145505
Florida       170312  21538187
New York      141297  20201249
Pennsylvania  119280  13002700

In [101]:
data['area'] # dictionary-style indexing of the column name

California      423967
Texas           695662
Florida         170312
New York        141297
Pennsylvania    119280
Name: area, dtype: int64

In [102]:
data.area # attribute-style access with column names

California      423967
Texas           695662
Florida         170312
New York        141297
Pennsylvania    119280
Name: area, dtype: int64

DataFrame as Two-Dimensional Array

In [103]:
data.values

array([[  423967, 39538223],
       [  695662, 29145505],
       [  170312, 21538187],
       [  141297, 20201249],
       [  119280, 13002700]])

In [105]:
data.T # transpose

      California     Texas   Florida  New York  Pennsylvania
area      423967    695662    170312    141297        119280
pop     39538223  29145505  21538187  20201249      13002700

In [106]:
data.values[0]

array([  423967, 39538223])

In [109]:
data.loc[data.area > 120, ['pop', 'area']]

                   pop    area
California    39538223  423967
Texas         29145505  695662
Florida       21538187  170312
New York      20201249  141297
Pennsylvania  13002700  119280

# Operating on Data in Pandas

In [110]:
import pandas as pd
import numpy as np

In [112]:
rng = np.random.default_rng(42)
ser = pd.Series(rng.integers(0,10,4))
ser

0    0
1    7
2    6
3    4
dtype: int64

In [114]:
df = pd.DataFrame(rng.integers(0,10,(3,4)),columns=['A','B','C','D'])

In [115]:
df

   A  B  C  D
0  4  8  0  6
1  2  0  5  9
2  7  7  7  7

In [116]:
np.exp(ser)

0       1.000000
1    1096.633158
2     403.428793
3      54.598150
dtype: float64

In [117]:
np.sin(df*np.pi/4)

              A             B         C         D
0  1.224647e-16 -2.449294e-16  0.000000 -1.000000
1  1.000000e+00  0.000000e+00 -0.707107  0.707107
2 -7.071068e-01 -7.071068e-01 -0.707107 -0.707107

In [118]:
# Index Alignment in Series
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                          'California': 423967}, name='area')
population = pd.Series({'California': 39538223, 'Texas': 29145505,
                                'Florida': 21538187}, name='population')

In [119]:
population/area

Alaska              NaN
California    93.257784
Florida             NaN
Texas         41.896072
dtype: float64

In [120]:
area.index.union(population.index)

Index(['Alaska', 'California', 'Florida', 'Texas'], dtype='object')

In [121]:
A = pd.Series([2, 4, 6], index=[0, 1, 2]) 
B = pd.Series([1, 3, 5], index=[1, 2, 3]) 
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [123]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

# Handling Missing Data

In [124]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [126]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [128]:
x[0] = None 
x
# Notice that in addition to casting the integer array to floating point, Pandas automati‐ cally converts the None to a NaN value.

0    NaN
1    1.0
dtype: float64

In [129]:
# Detecting Null Values
data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [130]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [131]:
data[data.notnull()] #Boolean masks

0        1
2    hello
dtype: object

In [132]:
# Dropping Null Values
data.dropna()

0        1
2    hello
dtype: object

In [133]:
df = pd.DataFrame([[1,      np.nan, 2],
                 [2,      3,      5], [np.nan, 4,      6]])

In [134]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [137]:
df.dropna() # We cannot drop single values from a DataFrame; we can only drop entire rows or col‐ umns.

     0    1  2
1  2.0  3.0  5

In [138]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [139]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [140]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

You can also specify how='all', which will only drop rows/columns that contain all null values:

In [143]:
df.dropna(axis='rows', thresh=3)
# Here, the first and last rows have been dropped because they each contain only two
# non-null values.

     0    1  2   3
1  2.0  3.0  5 NaN

Filling Null Values

In [145]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'),
                 dtype='Int32')

In [146]:
data

a       1
b    <NA>
c       2
d    <NA>
e       3
dtype: Int32

In [147]:
data.fillna(0)

a    1
b    0
c    2
d    0
e    3
dtype: Int32

In [153]:
# forward fill 
data.fillna(method='ffill')

/var/folders/bt/35f6qmss40lcsmbmj3srx0zc0000gn/T/ipykernel_2226/3173140211.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill')

a    1
b    1
c    2
d    2
e    3
dtype: Int32

In [164]:
# back fill 
data.fillna(method='bfill')

/var/folders/bt/35f6qmss40lcsmbmj3srx0zc0000gn/T/ipykernel_2226/1686884525.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='bfill')

a    1
b    2
c    2
d    3
e    3
dtype: Int32

In [165]:
df.fillna(method='ffill', axis=1)

/var/folders/bt/35f6qmss40lcsmbmj3srx0zc0000gn/T/ipykernel_2226/901808322.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

if a previous value is not available during a forward fill, the NA value remains.

# Hierarchical Indexing

In [166]:
import pandas as pd
import numpy as np

In [167]:
index = [('California', 2010), ('California', 2020),
                 ('New York', 2010), ('New York', 2020),
                 ('Texas', 2010), ('Texas', 2020)]
populations = [37253956, 39538223,
                       19378102, 20201249,
                       25145561, 29145505]
pop = pd.Series(populations, index=index)
pop

(California, 2010)    37253956
(California, 2020)    39538223
(New York, 2010)      19378102
(New York, 2020)      20201249
(Texas, 2010)         25145561
(Texas, 2020)         29145505
dtype: int64

In [168]:
pop[('California', 2020):('Texas', 2010)]

(California, 2020)    39538223
(New York, 2010)      19378102
(New York, 2020)      20201249
(Texas, 2010)         25145561
dtype: int64

In [169]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

The Better Way: The Pandas MultiIndex

In [170]:
index = pd.MultiIndex.from_tuples(index)

In [172]:
pop = pop.reindex(index)
pop

California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [174]:
pop[:, 2020] # The result is a singly indexed Series with just the keys we’re interested in

California    39538223
New York      20201249
Texas         29145505
dtype: int64

MultiIndex as Extra Dimension

The unstack method will quickly convert a multiply indexed Series into a conventionally indexed DataFrame:

In [176]:
pop_df = pop.unstack()
pop_df

                2010      2020
California  37253956  39538223
New York    19378102  20201249
Texas       25145561  29145505

In [177]:
pop_df.stack()

California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [178]:
data = {('California', 2010): 37253956,
                 ('California', 2020): 39538223,
                 ('New York', 2010): 19378102,
                 ('New York', 2020): 20201249,
                 ('Texas', 2010): 25145561,
                 ('Texas', 2020): 29145505}
pd.Series(data)

California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [179]:
pop.index.names = ['state', 'year']
pop

state       year
California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

# Combining Datasets: concat and append

In [183]:
import pandas as pd 
import numpy as np

In [186]:
def make_df(cols, ind):
    data = {c: [str(c) + str(i) for i in ind] 
            for c in cols}
    return pd.DataFrame(data, ind)

# example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [188]:
class display(object):

    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}{1} """
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    def __ref__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

In [189]:
# Simple Concatenation with pd.concat
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [190]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
display('df1', 'df2', 'pd.concat([df1, df2])')

In [192]:
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
display('df3', 'df4', "pd.concat([df3, df4], axis='columns')")

In [193]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
display('df5', 'df6',
         "pd.concat([df5, df6], join='inner')")

# Combining Datasets: merge and join

One-to-One Joins

Simplest type of merge is the one-to-one join, which is in many ways sim‐ ilar to the column-wise concatenation

In [196]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                            'group': ['Accounting', 'Engineering',
                                      'Engineering', 'HR']})

In [197]:
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                            'hire_date': [2004, 2008, 2012, 2014]})

In [203]:
display('df1', 'df2')

In [204]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

Many-to-One Joins

Many-to-one joins are joins in which one of the two key columns contains duplicate entries. 

For the many-to-one case, the resulting DataFrame will preserve those dupli‐ cate entries as appropriate.

In [205]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                            'supervisor': ['Carly', 'Guido', 'Steve']})
display('df3', 'df4', 'pd.merge(df3, df4)')

Many-to-Many Joins

If the key column in both the left and right arrays contains duplicates, then the result is a many-to-many merge.

In [206]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                                      'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'software', 'math',
                                       'spreadsheets', 'organization']})
display('df1', 'df5', "pd.merge(df1, df5)")

Specification of the Merge Key

In [210]:
# The on Keyword
'''
This option works only if both the left and right 
DataFrames have the specified column name.
'''
display('df1', 'df2', "pd.merge(df1, df2, on='employee')")

In [217]:
# The left_on and right_on Keywords
'''
At times you may wish to merge two datasets with 
different column names; for example, we may have a 
dataset in which the employee name 
is labeled as “name” rather than “employee”. 
'''
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                            'salary': [70000, 80000, 120000, 90000]})
display('df1', 'df3', 'pd.merge(df1, df3, left_on="employee",right_on="name")')

The result has a redundant column that we can drop if desired—for example, by using the DataFrame.drop() method:

In [218]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [219]:
# The left_index and right_index Keywords
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
display('df1a', 'df2a')

In [220]:
display('df1a', 'df2a', "pd.merge(df1a, df2a, left_index=True, right_index=True)")

For convenience, Pandas includes the DataFrame.join() method, which performs an index-based merge without extra keywords:

In [221]:
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [223]:
display('df1a', 'df3', "pd.merge(df1a, df3, left_index=True,right_on='name')")

Specifying Set Arithmetic for Joins

In [224]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                             'food': ['fish', 'beans', 'bread']},
                            columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                             'drink': ['wine', 'beer']},
                            columns=['name', 'drink'])
display('df6', 'df7', 'pd.merge(df6, df7)')

In [225]:
# inner join
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [226]:
# outer join
display('df6', 'df7', "pd.merge(df6, df7, how='outer')")

In [227]:
# left join
display('df6', 'df7', "pd.merge(df6, df7, how='left')")

In [228]:
# right join
display('df6', 'df7', "pd.merge(df6, df7, how='right')")

Overlapping Column Names: The suffixes Keyword

In [229]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                             'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                             'rank': [3, 1, 4, 2]})
display('df8', 'df9', 'pd.merge(df8, df9, on="name")')

Because the output would have two conflicting column names, the merge function automatically appends the suffixes _x and _y to make the output columns unique.

If these defaults are inappropriate, it is possible to specify a custom suffix using the suf fixes keyword:

In [230]:
pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

Example: US States Data

In [231]:
# Following are commands to download the data
repo = "https://raw.githubusercontent.com/jakevdp/data-USstates/master" # !cd data && curl -O {repo}/state-population.csv
!cd data && curl -O {repo}/state-areas.csv
!cd data && curl -O {repo}/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   835  100   835    0     0   1569      0 --:--:-- --:--:-- --:--:--  1578
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   872  100   872    0     0   2049      0 --:--:-- --:--:-- --:--:--  2076

In [232]:
pop = pd.read_csv('data/state-population.csv')
areas = pd.read_csv('data/state-areas.csv')
abbrevs = pd.read_csv('data/state-abbrevs.csv')

In [233]:
display('pop.head()', 'areas.head()', 'abbrevs.head()')

Given this information, say we want to compute a relatively straightforward result: rank US states and territories by their 2010 population density.

In [234]:
merged = pd.merge(pop, abbrevs, how='outer',
                  left_on='state/region', right_on='abbreviation')
merged = merged.drop('abbreviation', axis=1) # drop duplicate info
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [235]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [236]:
# Some of the population values are null; let’s figure out which these are!

In [237]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [238]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [239]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [240]:
final = pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [241]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [242]:
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [243]:
final.dropna(inplace=True)

In [244]:
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [245]:
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [246]:
data2010.set_index('state', inplace=True)
density = data2010['population'] / data2010['area (sq. mi)']

In [247]:
density.sort_values(ascending=False, inplace=True) 
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [248]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

# Aggregation and Grouping

In [249]:
import seaborn as sns
planets = sns.load_dataset('planets') 
planets.shape

(1035, 6)

In [250]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

Simple Aggregation in Pandas

In [251]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [252]:
ser.sum()

2.811925491708157

In [253]:
ser.mean()

0.5623850983416314

In [256]:
df = pd.DataFrame({'A': rng.rand(5),'B': rng.rand(5)})

In [257]:
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [258]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [259]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [260]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [261]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                            'data': range(6)}, columns=['key', 'data'])

In [262]:
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [263]:
df.groupby('key')

In [264]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [265]:
planets.groupby('method')

In [266]:
planets.groupby('method')['orbital_period']

In [267]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [268]:
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.0
       Eclipse Timing Variations           9.0
       Imaging                            38.0
       Microlensing                       23.0
       Orbital Brightness Modulation       3.0
                                         ...
max    Pulsar Timing                    2011.0
       Pulsation Timing Variations      2007.0
       Radial Velocity                  2014.0
       Transit                          2014.0
       Transit Timing Variations        2014.0
Length: 80, dtype: float64

In [269]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                            'data1': range(6),
                            'data2': rng.randint(0, 10, 6)},
                            columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [270]:
df.groupby('key').aggregate(['min', np.median, max])

/var/folders/bt/35f6qmss40lcsmbmj3srx0zc0000gn/T/ipykernel_2226/968873422.py:1: FutureWarning: The provided callable <function median at 0x111215440> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby('key').aggregate(['min', np.median, max])
/var/folders/bt/35f6qmss40lcsmbmj3srx0zc0000gn/T/ipykernel_2226/968873422.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [271]:
df.groupby('key').aggregate({'data1': 'min',
                                      'data2': 'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [272]:
def filter_func(x):
    return x['data2'].std() > 4

display('df', "df.groupby('key').std()",
        "df.groupby('key').filter(filter_func)")

In [273]:
def center(x):
    return x - x.mean()
df.groupby('key').transform(center)

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [274]:
def norm_by_data2(x):
# x is a DataFrame of group values
    x['data1'] /= x['data2'].sum() 
    return x

df.groupby('key').apply(norm_by_data2)

      key     data1  data2
key
A   0   A  0.000000      5
    3   A  0.375000      3
B   1   B  0.142857      0
    4   B  0.571429      7
C   2   C  0.166667      3
    5   C  0.416667      9

In [275]:
L = [0, 1, 0, 1, 2, 0]
df.groupby(L).sum()

   key  data1  data2
0  ACC      7     17
1   BA      4      3
2    B      4      7

In [276]:
df.groupby(df['key']).sum()

     data1  data2
key
A        3      8
B        5      7
C        7     12

In [277]:
df2 = df.set_index('key')
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
display('df2', 'df2.groupby(mapping).sum()')

# Pivot Tables

Think of pivot tables as essentially a multidimensional version of groupby aggregation.

In [278]:
import numpy as np 
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [279]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [280]:
sns.load_dataset?

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      ~/anaconda3/lib/python3.11/site-packages/seaborn/utils.py
Type:      function

In [281]:
titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [286]:
titanic.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

/var/folders/bt/35f6qmss40lcsmbmj3srx0zc0000gn/T/ipykernel_2226/602533180.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [287]:
titanic.pivot_table('survived', index='sex', columns='class', aggfunc='mean')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [289]:
age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [290]:
fare = pd.qcut(titanic['fare'], 2)
titanic.pivot_table('survived', ['sex', age], [fare, 'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 80]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 80]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 80]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 80]  0.030303  0.192308

In [291]:
titanic.pivot_table(index='sex', columns='class',
aggfunc={'survived':sum, 'fare':'mean'})

/var/folders/bt/35f6qmss40lcsmbmj3srx0zc0000gn/T/ipykernel_2226/3222443986.py:1: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  titanic.pivot_table(index='sex', columns='class',

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

# Vectorized String Operations

In [292]:
import numpy as np
x = np.array([2, 3, 5, 7, 11, 13]) 
x*2

array([ 4,  6, 10, 14, 22, 26])

This vectorization of operations simplifies the syntax of operating on arrays of data: we no longer have to worry about the size or shape of the array, but just about what operation we want done.

In [293]:
data = ['peter', 'Paul', 'MARY', 'gUIDO'] 
[s.capitalize() for s in data]

['Peter', 'Paul', 'Mary', 'Guido']

In [294]:
import pandas as pd 
names = pd.Series(data)
names.str.capitalize()

0    Peter
1     Paul
2     Mary
3    Guido
dtype: object

In [295]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
                           'Eric Idle', 'Terry Jones', 'Michael Palin'])

In [296]:
monte.str.lower()

0    graham chapman
1       john cleese
2     terry gilliam
3         eric idle
4       terry jones
5     michael palin
dtype: object

In [297]:
monte.str.len()

0    14
1    11
2    13
3     9
4    11
5    13
dtype: int64

In [298]:
monte.str.startswith('T')

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [299]:
monte.str.split()

0    [Graham, Chapman]
1       [John, Cleese]
2     [Terry, Gilliam]
3         [Eric, Idle]
4       [Terry, Jones]
5     [Michael, Palin]
dtype: object

In [300]:
monte.str.findall(r'^[^AEIOU].*[^aeiou]$')

0    [Graham Chapman]
1                  []
2     [Terry Gilliam]
3                  []
4       [Terry Jones]
5     [Michael Palin]
dtype: object

In [301]:
monte.str[0:3]

0    Gra
1    Joh
2    Ter
3    Eri
4    Ter
5    Mic
dtype: object

In [302]:
monte.str.split().str[-1]

0    Chapman
1     Cleese
2    Gilliam
3       Idle
4      Jones
5      Palin
dtype: object

In [304]:
full_monte = pd.DataFrame({'name': monte,
                                    'info': ['B|C|D', 'B|D', 'A|C',
                                      'B|D', 'B|C', 'B|C|D']})       
full_monte

             name   info
0  Graham Chapman  B|C|D
1     John Cleese    B|D
2   Terry Gilliam    A|C
3       Eric Idle    B|D
4     Terry Jones    B|C
5   Michael Palin  B|C|D

# Working with Time Series

In [305]:
from datetime import datetime 
datetime(year=2021, month=7, day=4)

datetime.datetime(2021, 7, 4, 0, 0)

In [306]:
from dateutil import parser
date = parser.parse("4th of July, 2021") 
date

datetime.datetime(2021, 7, 4, 0, 0)

In [307]:
date.strftime('%A')

'Sunday'

In [308]:
import numpy as np
date = np.array('2021-07-04', dtype=np.datetime64) 
date

array('2021-07-04', dtype='datetime64[D]')

In [309]:
date + np.arange(12)

array(['2021-07-04', '2021-07-05', '2021-07-06', '2021-07-07',
       '2021-07-08', '2021-07-09', '2021-07-10', '2021-07-11',
       '2021-07-12', '2021-07-13', '2021-07-14', '2021-07-15'],
      dtype='datetime64[D]')

In [310]:
import pandas as pd
date = pd.to_datetime("4th of July, 2021") 
date

Timestamp('2021-07-04 00:00:00')

In [311]:
date.strftime('%A')

'Sunday'

# High-Performance Pandas: eval and query

In [312]:
import numpy as np
rng = np.random.default_rng(42)
x = rng.random(1000000) 
y = rng.random(1000000) 
%timeit x + y

1.15 ms ± 33.4 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [313]:
%timeit np.fromiter((xi + yi for xi, yi in zip(x, y)), dtype=x.dtype, count=len(x))

136 ms ± 183 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [314]:
mask = (x > 0.5) & (y < 0.5)

In [315]:
tmp1 = (x > 0.5)
tmp2 = (y < 0.5)
mask = tmp1 & tmp2

In [316]:
import numexpr
mask_numexpr = numexpr.evaluate('(x > 0.5) & (y < 0.5)') 
np.all(mask == mask_numexpr)

True

In [317]:
import pandas as pd
nrows, ncols = 100000, 100
df1, df2, df3, df4 = (pd.DataFrame(rng.random((nrows, ncols))) for i in range(4))

In [318]:
%timeit df1 + df2 + df3 + df4

29.3 ms ± 5.61 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [319]:
%timeit pd.eval('df1 + df2 + df3 + df4')

15.6 ms ± 346 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [321]:
df1, df2, df3, df4, df5 = (pd.DataFrame(rng.integers(0, 1000, (100, 3))) for i in range(5))

The eval version of this expression is about 50% faster (and uses much less memory), while giving the same result:

In [322]:
# Arithmetic operators
result1 = -df1 * df2 / (df3 + df4) - df5
result2 = pd.eval('-df1 * df2 / (df3 + df4) - df5')
np.allclose(result1, result2)

True

In [323]:
# Comparison operators
result1 = (df1 < df2) & (df2 <= df3) & (df3 != df4)
result2 = pd.eval('df1 < df2 <= df3 != df4')
np.allclose(result1, result2)

True

In [325]:
# np.allclose?

In [326]:
# Bitwise operators
result1 = (df1 < 0.5) & (df2 < 0.5) | (df3 < df4)
result2 = pd.eval('(df1 < 0.5) & (df2 < 0.5) | (df3 < df4)')
np.allclose(result1, result2)

True

In [327]:
result3 = pd.eval('(df1 < 0.5) and (df2 < 0.5) or (df3 < df4)')
np.allclose(result1, result3)

True

In [328]:
# Object attributes and indices
result1 = df2.T[0] + df3.iloc[1]
result2 = pd.eval('df2.T[0] + df3.iloc[1]')
np.allclose(result1, result2)

True

In [329]:
df = pd.DataFrame(rng.random((1000, 3)), columns=['A', 'B', 'C'])
df.head()

          A         B         C
0  0.850888  0.966709  0.958690
1  0.820126  0.385686  0.061402
2  0.059729  0.831768  0.652259
3  0.244774  0.140322  0.041711
4  0.818205  0.753384  0.578851

In [330]:
df.eval('D = (A + B) / C', inplace=True) 
df.head()

          A         B         C          D
0  0.850888  0.966709  0.958690   1.895916
1  0.820126  0.385686  0.061402  19.638139
2  0.059729  0.831768  0.652259   1.366782
3  0.244774  0.140322  0.041711   9.232370
4  0.818205  0.753384  0.578851   2.715013

In [331]:
df.eval('D = (A - B) / C', inplace=True) 
df.head()

          A         B         C         D
0  0.850888  0.966709  0.958690 -0.120812
1  0.820126  0.385686  0.061402  7.075399
2  0.059729  0.831768  0.652259 -1.183638
3  0.244774  0.140322  0.041711  2.504142
4  0.818205  0.753384  0.578851  0.111982

In [332]:
# The DataFrame.query Method
Cmean = df['C'].mean()
result1 = df[(df.A < Cmean) & (df.B < Cmean)]
result2 = df.query('A < @Cmean and B < @Cmean')
np.allclose(result1, result2)

True

Note that the query method also accepts the @ flag to mark local variables.

Performance: When to Use These Functions

When considering whether to use eval and query, there are two considerations: com‐ putation time and memory use.

Memory use is the most predictable aspect.

In [333]:
x = df[(df.A < 0.5) & (df.B < 0.5)]

In [334]:
# is roughly equivalent to this:
tmp1 = df.A < 0.5
tmp2 = df.B < 0.5
tmp3 = tmp1 & tmp2
x = df[tmp3]

In [336]:
# You can check the approximate size of your array in bytes using this:
df.values.nbytes

32000